"""
算法运算符：
加法：+
减法：-
乘法：*
指数：**
取余：%
除法：/    （包括小数点后面的数）
地板除：//  （忽略小数点后面的小数位，只保留整数部分）
"""
print('算术运算符：')
a = 5
b = 3
print('a和b的值分别为：', a, ',', b)
print('乘法：a*b=', a * b)
print('指数：a**b=', a ** b)
print('除法：a/b=', a / b)
print('地板除：a//b=', a // b)

'''
比较运算符
等于：==
不等于：!=
大于：>
小于：<
大于等于：>=
小于等于：<=
'''

'''
逻辑运算符：
逻辑与：and
逻辑或：or
逻辑非：not
优先级：() > not > and > or
'''
print('------------------------------')
print('逻辑运算符：')
print(a, 'and', b, '都大于2为', a and b > 2)  # and这样写也可以
print(a, 'and', b, '都大于2为', a > 2 and b > 2)
print(a, 'and', b, '都大于3为', a and b > 3)
print(a, 'and', b, '都大于3为', a > 3 and b > 3)
print(a, 'or', b, '大于3为', (a > 3 or b > 3))
print(a, 'or', b, '大于3为', (a or b > 3))  # 但or不能这样写

'''
赋值运算符：
赋值运算符：=
加法赋值运算符：+=
减法赋值运算符：-=
乘法赋值运算符：*=
除法赋值运算符：/=
取模赋值运算符：%=
幂赋值运算符：**=
取整赋值运算符：//=
'''

print('-----------------------')
'''
三元运算符：a if b else c
如果表达式 b 为真，则返回 表达式 a 的结果，否则返回 表达式 c 的结果
'''
age = 14
print('可以参军' if age > 18 else '继续上学')
print(4 if 4 > 5 else 5)
print(age - 1 if age > 18 else age + 1)
